% 传入参量PRN
function CAcode=generateCAcode(PRN)

% 顺序写出每个PRN的位移量g2s，并将当前PRN的位移量赋给g2shift
g2s=[5,   6,   7,   8,  17,  18, 139, 140, 141, 251, ...
       252, 254, 255, 256, 257, 258, 469, 470, 471, 472, ...
       473, 474, 509, 512, 513, 514, 515, 516, 859, 860, ...
       861, 862 ,145, 175,  52,  21, 237, 235, 886, 657, ...
       634, 762, 355, 1012, 176, 603, 130, 359, 595, 68, ...
       386];
g2shift=g2s(PRN);  

% 初始化G1和reg（寄存器）
G1=zeros(1,1023);
reg=-ones(1,10);
% 分别计算1023个G1、G2，方法按照原理图即可
for i=1:1023
    G1(i)=reg(10);
    bit=reg(3)*reg(10);
    reg(2:10)=reg(1:9);
    reg(1)=bit;
end


G2=zeros(1,1023);
reg=-ones(1,10);
for i=1:1023
    G2(i)=reg(10);
    bit=reg(2)*reg(3)*reg(6)*reg(8)*reg(9)*reg(10);
    reg(2:10)=reg(1:9);
    reg(1)=bit;
end

% 对g2进行位移，生成G2i
G2i=[G2(1023-g2shift+1:1023) G2(1:1023-g2shift)];


% 将G2与G1相异或得到结果CAcode
CAcode=-(G1.*G2i);

